# 登入密碼設定
password = "91166964"

# 考核評分選項
REVIEW_OPTIONS = ["++", "+", "無", "-", "--"]

# 考核項目與說明（依分類群組）
REVIEW_CATEGORIES = {
    "AA01 達成率": {
        "第1月AA01達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
        "第2月AA01達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
        "第3月AA01達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
        "第4月AA01達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
        "第5月AA01達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
        "第6月AA01達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
    },
    "AA02 達成率": {
        "第1月AA02達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
        "第2月AA02達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
        "第3月AA02達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
        "第4月AA02達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
        "第5月AA02達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
        "第6月AA02達成率": "95%以上++、90-94%+、85-89%以上-、80-84%--",
    },
    "綜合評估項目": {
        "辦理跨專業討論會議": "完成+、無須辦理x、未完成-",
        "辦理區域聯繫會議": "完成+、無須辦理x、未完成-",
        "表揚及客訴(須說明)": "獲表揚(依情節+或++)、無x、客訴(依情節-或--)",
        "工作配合度": "良好++、合格+、待加強-、不理想--",
        "溝通協調能力": "良好++、合格+、待加強-、不理想--",
        "專業知能": "良好++、合格+、待加強-、不理想--",
    }
}


# 評分選項
REVIEW_OPTIONS = ["++", "+", "無", "-", "--"]
